app/controllers/enderecos_controller.rb

  def new
    @hospede = Hospede.find(params[:hospede_id])
---
SELECT "hospedes".* FROM "hospedes" WHERE "hospedes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    #@endereco = Endereco.new(valid_endereco)
    @hospede = Hospede.find(params[:hospede_id])
    @endereco = @hospede.build_endereco(valid_endereco)
    if @endereco.save
---
SELECT "hospedes".* FROM "hospedes" WHERE "hospedes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "enderecos" ("rua", "numero", "complemento", "bairro", "cidade", "estado", "pais", "cep", "created_at", "updated_at", "hospede_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "enderecos" SET "updated_at" = ?, "hospede_id" = ? WHERE "enderecos"."id" = ?  [["updated_at", "2022-10-27 19:33:44.998034"], ["hospede_id", nil], ["id", 1]]