app/controllers/hospedes_controller.rb

    def create
        @hospede = HospedeCreator.new(valid_params).create_hospede
---
INSERT INTO "hospedes" ("nome", "cpf", "email", "status", "celular", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)